<a href="https://colab.research.google.com/github/Luan-ATL/probabilidade-e-estatistica-python-/blob/main/PEE_Exerc%C3%ADcio_Pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('https://gist.githubusercontent.com/edupsousa/ea8c027229afc728a5092874824efdb7/raw/cffabcb768e497ddde6b5d8ea1a43c8bd81688bd/pee_pandas_ex1.csv')

In [ ]:
df

       Aluno  Semestre  Disciplina  Nota
0        Ana         1  Matemática     1
1        Ana         1   Português     6
2        Ana         2      Física     8
3        Ana         2    História     8
4    Beatriz         1  Matemática     7
5    Beatriz         1   Português     5
6    Beatriz         2      Física     4
7    Beatriz         2    História     8
8     Carlos         1  Matemática     4
9     Carlos         1   Português     8
10    Carlos         2      Física     3
11    Carlos         2    História    10
12    Daniel         1  Matemática     4
13    Daniel         1   Português     6
14    Daniel         2      Física     3
15    Daniel         2    História     9
16  Fernanda         1  Matemática     2
17  Fernanda         1   Português     8
18  Fernanda         2      Física     6
19  Fernanda         2    História     2
20      João         1  Matemática     1
21      João         1   Português     8
22      João         2      Física     8
23      João         2    História     2

### 1. Observe o comportamento nas células abaixo dos métodos head e tail. Explique na célula abaixo o que esses dois métodos fazem e para que serve o parâmetro "n" existente em cada um deles.

A função do metodo .head é de separar as primeiras linhas do Dataframe, a do metodo .tail é separar as ultimas linhas e o paramentro "n" indica a quantidade destas linhas.

In [ ]:
df.head(3)

  Aluno  Semestre  Disciplina  Nota
0   Ana         1  Matemática     1
1   Ana         1   Português     6
2   Ana         2      Física     8

In [ ]:
df.tail(3)

   Aluno  Semestre Disciplina  Nota
21  João         1  Português     8
22  João         2     Física     8
23  João         2   História     2

### 2. As séries de dados que compõe o data frame possuem métodos para extrair informações como média, máximo e minímo. Na célula abaixo é exibida maior nota utilizando o método max() da série de dados Nota. Modifique a linha abaixo para exibir a média geral das notas no lugar do valor máximo.

In [ ]:
df['Nota'].mean()

5.458333333333333

### 3. O exemplo abaixo mostra uma seleção condicional na qual são retornados todos os registros da disciplina de Física. Com base nesse exemplo, faça uma seleção condicional para retornar todos os registros com nota maior ou igual a 6.

In [ ]:
df[df['Disciplina'] == 'Física']

       Aluno  Semestre Disciplina  Nota
2        Ana         2     Física     8
6    Beatriz         2     Física     4
10    Carlos         2     Física     3
14    Daniel         2     Física     3
18  Fernanda         2     Física     6
22      João         2     Física     8

In [ ]:
df[df['Nota'] >= 6]

       Aluno  Semestre  Disciplina  Nota
1        Ana         1   Português     6
2        Ana         2      Física     8
3        Ana         2    História     8
4    Beatriz         1  Matemática     7
7    Beatriz         2    História     8
9     Carlos         1   Português     8
11    Carlos         2    História    10
13    Daniel         1   Português     6
15    Daniel         2    História     9
17  Fernanda         1   Português     8
18  Fernanda         2      Física     6
21      João         1   Português     8
22      João         2      Física     8

### 4. Utilize a propriedade .loc[] para retornar a nota na disciplina de Português do aluno Daniel.

In [ ]:
df.loc[13,'Nota']

6

### 5. Repita o procedimento do exercício 4, essa vez utilizando a propriedade .iloc[].

In [ ]:
df.iloc[13, 3]

6

### 6. Utilize o método groupby para obter a nota média em cada disciplina:

In [ ]:
df.groupby("Disciplina").mean()

            Semestre      Nota
Disciplina
Física           2.0  5.333333
História         2.0  6.500000
Matemática       1.0  3.166667
Português        1.0  6.833333

### 7. Obtenha a nota média para cada um dos alunos, no resultado exiba apenas o nome do aluno e a nota média (removendo a coluna semestre do resultado com o método .drop()).

In [ ]:
df.groupby('Aluno').mean().drop('Semestre', axis=1)

          Nota
Aluno
Ana       5.75
Beatriz   6.00
Carlos    6.25
Daniel    5.50
Fernanda  4.50
João      4.75